       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBEX02.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. TEST-ZOS.
       OBJECT-COMPUTER. DEV-ZOS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *"INPUT VARIABLES"
       01 WS-CLASS-01.
          05 WS-MARK-01   PIC 9(3) VALUE 0.
          05 WS-MARK-02   PIC 9(3) VALUE 0.
          05 WS-MARK-03   PIC 9(3) VALUE 0.
          05 WS-MARK-04   PIC 9(3) VALUE 0.
          05 WS-MARK-05   PIC 9(3) VALUE 0.
       01 WS-CLASS-02.
          05 WS-MARK-01   PIC 9(3) VALUE 0.
          05 WS-MARK-02   PIC 9(3) VALUE 0.
          05 WS-MARK-03   PIC 9(3) VALUE 0.
          05 WS-MARK-04   PIC 9(3) VALUE 0.
          05 WS-MARK-05   PIC 9(3) VALUE 0.
       77 WS-SUM-DIFF   PIC 9(03).
       PROCEDURE DIVISION.
       0000-MAIN-PARA.
            PERFORM 1000-INITIALIZE-PARA THRU
                       1000-INITIALIZE-PARA-EXIT.
            PERFORM 2000-PROCESS-PARA THRU
                       2000-PROCESS-PARA-EXIT.
            PERFORM 9000-TERMINATION-PARA THRU
                       9000-TERMINATION-PARA-EXIT.
       0000-MAIN-PARA-EXIT.
               EXIT.
       1000-INITIALIZE-PARA .
            INITIALIZE WS-CLASS-01 WS-CLASS-02 WS-SUB-DIFF.
       1000-INITIALIZE-PARA-EXIT.
            EXIT.
       2000-PROCESS-PARA.
            ACCEPT WS-CLASS-01.
            MOVE 080060075050095 TO WS-CLASS-02.
            ADD CORRESPONDING WS-CLASS-01 TO WS-CLASS-02.
            SUBTRACT WS-MARK-03 OF WS-CLASS-02 FROM WS-MARK-03 OF
            WS-CLASS-03 GIVING WS-SUM-DIFF.
            ON SIZE ERROR.
            DISPLAY "OVERFLOW OCCURED".
            DISPLAY "CONTENT OF WS-CLASS-02:" OF WS-CLASS-02.
            DISPLAY "CONTENT OF WS-MARK-03:" WS-MARK-03 OF WS-CLASS-02.
            DISPLAY "MARK-03 DIFFERENCE BETWEEN CLASSES:" WS-SUM-DIFF.
       2000-PROCESS-PARA-EXIT.
            EXIT.
       9000-TERMINATION-PARA.
            EXIT .
       9000-TERMINATION-PARA-EXIT.
            STOP RUN.
