//TECN091A JOB NOTIFY=&SYSUID
//SET SET EX=COBEX03
//STEP01 EXEC IGYWCL
//SYSPRINT DD SYSOUT=*
//COBOL.SYSIN DD DSN=TECN091.CODE.COBOL(&EX),DISP=SHR
//LKED.SYSLMOD DD DSN=TECN091.COB.LOAD(&EX),DISP=SHR
//STEP02 EXEC PGM=&EX
//STEPLIB DD DN=TECN091.COB.LOAD,DISP=SHR
//SYSIN DD DUMMY
//